[{"user_id": "shipo", "date": "January 17, 2006 10:13AM", "comment": "Ah yes, you did indeed jog my memory. There was speculation about flat bedding the car when it was first stolen, but you're right, in the end it was determined to be the key situation you described. :blush:\n\nI was confusing that scenario with one the my kid brother had at about the same time where his Yukon (complete with OnStar) got nicked. The Toronto police told him that it was most likely already on a boat and headed for Russia, securely inside the same shielded (as in impervious to Lojack and OnStar signals) container box that it was stuffed into right out of the hotel parking lot. Funny thing about that one, the car was recovered a year later in Indiana. Hmmm, last time I checked, Indiana was a LONG way from Moscow. ;-)\n\nBest Regards,\nShipo"}, {"user_id": "venture", "date": "January 17, 2006 10:10PM", "comment": "\"...for just everyday driving to work & back (7 miles down 1 street), I really would like more interior niceties than BMW offers in the 3-series.\"\n\nI was just going to let that pass, but it's been bugging me.\n\nFor a 7 mile drive on the same street I don't think I'd be real concerned about niceities. After all, how long does it take - 10 minutes?\n\nOne thing about a BMW, especially the 3 series, is the way the interior is put together doesn't actually become obvious until you live with the car a while. Then you start to appreciate the way everything is at hand and is where it should be - the way everything is designed as a \"package\" and not parts just thrown together makes ownership appreciate as you drive it.\n\nA BMW is for driving anyway, not for looking at. :shades:"}, {"user_id": "blueguydotcom", "date": "January 17, 2006 10:31PM", "comment": "Amen. I can be driving 500 miles or 5 blocks and I eagerly look forward to that drive. A 7 mile drive = 7 miles of fun.\n\nHe obviously looks at cars differently. I hope one day I never view my car as just transportation. Life's too short."}, {"user_id": "laurasdada", "date": "January 18, 2006 10:38AM", "comment": "\"A BMW is for driving anyway, not for looking at.\"\n\nA concise explanation of BMWs current design philosophy!"}, {"user_id": "nyccarguy", "date": "January 18, 2006 8:25PM", "comment": "not interested in either car (at anytime). I was just curious about what you thought. I respect your opinion...that's all.\n\nHow'd you like that 130i reviewed in ROUNDEL? Pretty sweet!"}, {"user_id": "03accordman", "date": "January 19, 2006 12:16PM", "comment": "\"A BMW is for driving anyway, not for looking at\"\n\nWhat say iDrive?"}, {"user_id": "kdshapiro", "date": "January 19, 2006 1:15PM", "comment": "\"What say iDrive?\"\n\nI drive, you drive, we all drive."}, {"user_id": "blueguydotcom", "date": "January 19, 2006 2:38PM", "comment": "iDrive is an option and furthermore it's easy to use. Sorry but every complaint about iDrive reminds me of the people who complain about Tivo or Meesenger or any other product that will take a person 1-2 minutes to understand on a surface level."}, {"user_id": "bdr127", "date": "January 20, 2006 9:37AM", "comment": "iDrive is an option and furthermore it's easy to use. Sorry but every complaint about iDrive reminds me of the people who complain about Tivo or Meesenger or any other product that will take a person 1-2 minutes to understand on a surface level.\n\nThe version of iDrive in the 2002 7-series was fairly difficult to use.... Now, however, iDrive is so intuitive to anyone that uses a desktop/laptop computer. I think people just have preconceived ideas about iDrive based on what they heard 5 years ago and immediately judge it without even trying it."}, {"user_id": "03accordman", "date": "January 20, 2006 1:10PM", "comment": "Its easy to use 'now' after many changes; that too when the car is standing still. BMWs are cars to be driven; last thing you want to do is open a laptop and start going through menus.\n\nAnyway, this is my opinion and could well be different from yours; however I haven't seen many people I know who love the iDrive in their Bimmers."}, {"user_id": "bdr127", "date": "January 20, 2006 1:50PM", "comment": "Conversely, if BMW didn't incorporate new technology in its cars, their competitors would pass them buy.... A double-edged sword.\n\nThe funny thing is, though, that many the other luxury car makers are following BMW's lead and putting in their own version of iDrive.\n\nNotice how many other luxury marques are doing the whole \"joystick\" thing?.... Funny how BMW takes the heat 3-4 years early, then everyone else follows along.\n\nACURA:\n\n\nINFINITI:\n\n\nAUDI:\n\n\nBMW:"}, {"user_id": "ro22ne", "date": "January 20, 2006 3:36PM", "comment": "looking for a midsized, midpriced (or less)luxury sedan. Most importantly has to be excellent in the snow. Good gas mileage would be a plus. Not too picky on bells and whistles. thank you"}, {"user_id": "mvc_jones", "date": "January 20, 2006 3:45PM", "comment": "It would help me to suggest something if you define what midpriced or less means as a range. Without any other information, some ideas would be:\n\nSubaru Legacy (not too much luxury, though, IMO)\nInfiniti G35x\nAcura TSX or TL\nLexus IS AWD\nAudi A4 Quattro"}, {"user_id": "ro22ne", "date": "January 20, 2006 4:03PM", "comment": "I think I'd like to keep it under 40K. I'm not really a car afficianado. Usually buy a car and hold it for many years. Currently have a SAAB 93 but it is terrible in the snow even with snow tires. Perhaps I should get a young, used, low mileage vehicle rather than a new one being that I'm not a car person. thanks, ron"}, {"user_id": "mvc_jones", "date": "January 20, 2006 4:13PM", "comment": "If you want something simple, nice, good in the snow with limited luxury (and back seat room) a Subaru Legacy or Legacy GT might be a good choice, and they tend to last a long time.\n\nThey are not considered a luxury brand (but aspire to be one) but a very solid car, and the GT is quite powerful/fun to drive. Main issues for me were subpar gas mileage, smaller backseat, and design was a little on the plain side (although tasteful and simple.)\n\nThis was my second choice to the Acura TL, TL was a better value proposition to me (even though it cost more), I liked the design, features, back seat room, etc... Snow was not an issue in my purchase though.\n\nLuxury is a bit of a tough word to me now because non-luxury cars are more and more incorporating features that are generally considered luxury. Look at a full loaded Accord V6 with Nav vs. Acura TL or Lexus ES and you will see what I mean. To me, main differences are design quality (based on taste), material quality, and 'tuning' of engine, suspension, steering, etc..."}, {"user_id": "ro22ne", "date": "January 20, 2006 4:21PM", "comment": "The specifics of luxury are not too important to me. I do want luxury though and pretty much anything in the \"luxury\" category could fit the bill. I plan on making a short list and seeing what makes sense."}, {"user_id": "blueguydotcom", "date": "January 20, 2006 5:36PM", "comment": "A4 quattro avant with either engine.\na3 quattro with the 3.2 is a good choice too.\n\nAs others have mentioned:\n\n325xi (do eurodelivery and you'll get it for less than most of its competitors)\nG35x\nIS250 awd\nRL (can pick them up for under 40k and they're really, really nice)."}, {"user_id": "ro22ne", "date": "January 20, 2006 5:49PM", "comment": "Should I be sticking with the AWD vehicles? Is there a downside to awd? What about four wheele drive .... thanks"}, {"user_id": "cdnpinhead", "date": "January 20, 2006 6:27PM", "comment": "Four-wheel-drive (as opposed to all-wheel-drive) is strictly for serious off-road, low-range rock crawling, though it can be used in high range for the same sorts of things AWD is good for. The difference has to do with such arcane things as inter-axle & limited-slip differentials.\n\nI'm guessing you couldn't care less. AWD is automatic and is generally the best choice for those who are mostly concerned with highway traction (as opposed to off-road stuff). Subaru is the reigning king of this, but if you want \"luxury\" (however you define it -- there's lots of bickering potential here), the BMW & Audi options are good ones, and some are willing to admit that the Infiniti G can play too. I've spent quite a bit (but not nearly enough) of my life in Colorado, and I can assure you that the most common vehicle driven by locals in the \"high country\" (above 8000 feet -- say Winter Park/Fraser/Granby) is the Subaru.\n\nAudi has been doing this longer than anyone, and has the best (bar none) interiors in the business. Even if you don't know what luxury means, after you've sat in an Audi, you'll at least have a starting point."}, {"user_id": "ro22ne", "date": "January 20, 2006 8:24PM", "comment": "I've been reading at a different Edmunds Forum that Audi (more the A4) is not as reliable as it should be and it may lack a bit of power. Is this accurate?"}, {"user_id": "bdr127", "date": "January 21, 2006 7:57AM", "comment": "Should I be sticking with the AWD vehicles? Is there a downside to awd?\n\nFor most people it's not really an issue... but 1) with AWD, you get a slight loss in power and performance, because engine power is split between all wheels, as opposed to just two wheels. 2) Some people don't like the \"awkward\" feeling of the back-and-forth between oversteer and understeer. 3) AWD almost always results in lower gas mileage than the same car with 2WD. 4) AWD will almost always be more expensive than the same car with 2WD.\n\nI could be forgetting some things.... Regardless, I'm not trying to make a case against AWD, because I had an Audi A4 Quattro and loved the AWD system. You just wanted to also know the disadvantages."}, {"user_id": "kdshapiro", "date": "January 21, 2006 8:53AM", "comment": "Good point, those 4 pictures are worth 40,000 words."}, {"user_id": "kdshapiro", "date": "January 21, 2006 8:55AM", "comment": "I wouldn't get AWD unless I needed it. But living in a climate where lately a 2 foot snowfall is not out of the question, AWD is a good investment.\n\nThere have been arguments back and forth, pro and con, but my experience tells me, AWD is the ultimate winner for safe and efficient trave."}, {"user_id": "blueguydotcom", "date": "January 21, 2006 12:19PM", "comment": "The 2.0T makes 200 hp and 207 ft-lbs of torque at 1800 rpm, all the way to 5000 rpm. IMHO, it's a better engine than the nissan VQ, bmw inline 6 and toyota's lousy 2.5/3.5s from the IS250/350. Great, peppy, smooth, hard charging little 2.0T blows away the competition, imho."}, {"user_id": "ro22ne", "date": "January 21, 2006 7:03PM", "comment": "Have had bad experiences with cars in snow (honda and saab, both front wheele drive) and would like a sedan that can handle the snow. I live in Massachusetts. Is an awd the way to go or is there another option or is there a front wheele drive vehicle that can get the job done."}, {"user_id": "jaj", "date": "January 21, 2006 7:19PM", "comment": "Have you tried a set of dedicated snow tires on your cars? Before my current BMW AWD, I had snows on a Saab and had no problem.\n\n-jaj"}, {"user_id": "ro22ne", "date": "January 21, 2006 7:24PM", "comment": "tried 4 new snows on Saab 93 and still scared me in snow. First tried two in front which did nothing. The four only marginally improved situation."}, {"user_id": "shipo", "date": "January 21, 2006 10:44PM", "comment": "I live just north of you in southern New Hampshire and ran winter tires on my RWD 530i with great results. In fact I'll go so far as to say that it was the best winter ride I've ever had (best non-winter ride as well). While I've never had a FWD car with winter tires, I can only assume that a FWD Saab so shod would do pretty darn well in the white stuff.\n\nSo, given your experience a couple of things come to mind:\n\n1) You had crummy snow tires, or\n2) You need to consider relocating to Florida ;-)\n\nBest Regards,\nShipo"}, {"user_id": "esfoad", "date": "January 22, 2006 10:28AM", "comment": "I agree with Shipo. We have an 04 9-3 convertible with Goodyear snow tires. It's a tank ion the white stuff. Not quite sure what the guy is expecting."}, {"user_id": "laurasdada", "date": "January 22, 2006 10:51AM", "comment": "Out of curiosity, how long have you been driving in snow? I've driven FWD w/all seasons basically all my life with no real incidents to report. This includes regular ski trips to ME, VT and NH.\n\nThe Bridgestone all-season tires on my '05 TL are not very good in the snow (and will be replaced), but traction aids, snow driving sense and luck have gotten me there safely...\n\nAny FWD w/decent snows should more than suffice for NE winters. For going forward, AWD with snows would be the ultimate."}, {"user_id": "dewey", "date": "January 22, 2006 11:25AM", "comment": "I know there is no shortage of disappointing reviews about the Lexus IS350, but the paragraph below from the Wall Street Journal sums up the IS350 quite nicely.\n\nThat can be a plus for a big luxury car, but in a sport sedan we expect a seat-of-the pants feeling, and we didn't get it from the IS 350. We're tempted to blame that on such features as the Lexus's electronic throttle, which uses sensors on the gas pedal and computerized engine controls to replace the cable that usually connects the driver's foot to the engine. Or maybe it's the fact that the IS 350 isn't available with a manual transmission. (We had a lot of fun driving a BMW 3 Series with its manual option.) But those answers seem too simple. After all, we've enjoyed driving cars with automatics -- or even models with too much electronic wizardry -- when a winning vehicle lies beneath the gadgets. Somehow, the IS just doesn't hang together to create what we'd call a driver's car."}, {"user_id": "blueguydotcom", "date": "January 22, 2006 11:32AM", "comment": "That sums up the IS350. Decent car but not a driver's car by any means."}, {"user_id": "ro22ne", "date": "January 22, 2006 2:51PM", "comment": "been driving in N.E. 30 yrs. Have no problem in wifes Oddessey. A prior forum comment may have been right on with the suggestion of a better set of snows. thanks"}, {"user_id": "vchiu", "date": "January 22, 2006 10:51PM", "comment": "http://www.autobild.de/test/neuwagen/artikel.php?artikel_id=10563\n\nFor the German speaking. Very interesting comparison test between Lexus IS 250 and BMW 325.\n\"DOES LEXUS BUILD BETTER 3 SERIES?\"\n\nTo sum things up :\n1) The 3 is a bit quicker (0-100km/h in 7,3' instead of 8,1'). the IS engine is a bit strained\n2) it offers more mpg by 10-15%\n3) it's ride is more comfortable (Lexus had 18 inch tires)\n\nthe Lexus is 1500 Euro cheaper"}, {"user_id": "billyperks1", "date": "January 23, 2006 8:32AM", "comment": "Do you really think the 3.5 from Toyota is lousy?\nDid you test drive the IS350?\n\nThe reason I am asking you is, I am waiting for Toyota to introduce the GS350 because it seems like something I would be intrested in. The current AWD drive version of the GS is very sluggish in my estimation as well as the 530XI from BMW.\n\nAudi's A6 4.2 AWD seems like the way to go but when all the options are added its gets a bit pricey.\n\nIf this upcoming GS 350 is a slug I will be very disappointed."}, {"user_id": "03accordman", "date": "January 23, 2006 9:05AM", "comment": "I agree with you; most other lux carmakers are following BMW with iDrive kind of interfaces and letting BMW take the heat.\n\nIMO, technology just for the sake of technology serves no one. I am a big BMW fan and plan to buy my first this year (spring??); just don't like some of the things that have happened in the past few years in these segments; new age style included. i think the E90 is the best design to come out of BMW since Bangle took over. Again, my opinion!!!"}, {"user_id": "blueguydotcom", "date": "January 23, 2006 10:49AM", "comment": "Do you really think the 3.5 from Toyota is lousy?\n\nFast, fairly smooth engine. Nothing to write home about.\n\nDid you test drive the IS350?\n\nYes. Felt it was soft, steering didn't communicate well to the driver, had lousy seats, poor visibility, tranny was horrible and the car understeered like a FWD vehicle.\n\nIf this upcoming GS 350 is a slug I will be very disappointed.\n\nIt'll be fast. I'm not interested in merely fast. I want a sharp handling, involving drive. The IS350 was neither."}, {"user_id": "billyperks1", "date": "January 23, 2006 3:02PM", "comment": "I gothcha Blueguy.\n\nFor me fast is priority because I have something to prove.:)\n\nHandling must also be up there but I wouldn't break my neck to get Formula One handling.\n\nHow much handling do I need on the I95?"}, {"user_id": "blueguydotcom", "date": "January 23, 2006 3:16PM", "comment": "you can only go so fast on the freeway, back roads in the woods and on/off ramps. But with great handling those ramps, the back streets and the roads in the middle of nowhere become heavenly.\n\nHandling wins over power. If I can get both, I'll take it. For now, i'm driving the best compromise I've found. Ideally BMW will release a 335i soon and I can get the power bump I long for."}, {"user_id": "vanquish421", "date": "January 23, 2006 4:27PM", "comment": "This may seem like a dumb question, but I really don't know a lot about luxury sport sedans. I was curious as to whether or not a DVD based navigation system can play DVDs. I mean, it would make sense to me that they would...I was looking at a G35 coupe on eBay that showed Kill Bill playing on the navigation screen, but he modified his system so his Xbox could play through it, and he might be playing the DVD through the Xbox, see it here: http://cgi.ebay.com/ebaymotors/Infiniti-G35-2003-Vortech-Supercharged-G35-Coupe-- 6-speed_W0QQitemZ4606845482QQcategoryZ43914QQrdZ1QQcmdZViewItem. I just think when you pay $2000 extra for a 7\" screen in your car, it should do a little more than tell you where to go."}, {"user_id": "designman", "date": "January 23, 2006 5:01PM", "comment": "I agree with Blue. You don't always use available power, but handling comes into play on every inch of the road. Just my opinion and preference.\n\nHow much handling do I need on the I95?\n\nOn my piece of I95 (NJ Tpk) I am constantly dodging various junk strewn on the road... 2 x 4s, steel brackets, padlocks, broomhandles... yaddy yadda. Plus when you use 18-wheelers, poky Camrys and tardy Town Cars as pylons, handling rules.\n\n;-)"}, {"user_id": "bdr127", "date": "January 23, 2006 5:15PM", "comment": "I was curious as to whether or not a DVD based navigation system can play DVDs.\n\nNo, as far as I know, there are not any factory-equipped DVD navigation systems that also play movies for luxury sport sedans."}, {"user_id": "jchan2", "date": "January 23, 2006 6:29PM", "comment": "The Infiniti M does in the optional Journey package I think.\n\nYou can only watch movies on the navigation screen when the car is in park though.\n\nBut you can get a RES for the back seat of the M."}, {"user_id": "pgsmith", "date": "January 23, 2006 7:31PM", "comment": "I would agree w/ bdr127.\n\nI have a C280 w/ AWD. I am guessing I lose ~2-3mpg vs rwd. I took a recent road trip and only averaged 27.5 mpg cruising ~75.\n\nMany will argue that rdw or fwd is all you need (and not without merit). My preference was to sacrifice the 2-3mpg and power (yes, it is a noticable difference if you drive with any spirit).\n\nW/ rwd or fwd, you will do much better w/ snow tires. You will likely be better off with tires designed for ice and snow than M+S or A/S for winter driving (assuming you keep it on the road), although they often have a softer tread compound making them wear quicker.\n\nI have not really noticed a back and forth oversteer/understeer , or maybe I'm just used to it as I have been driving 4wd and AWD for years and may unconsciously compensate for it (or use it to my advantage).\n\nCost is a disadvantage although the level of the impact can be argued if you choose to run two sets of tires and consider the resale value the AWD will have. I beleive here has been a whole discussion on that subject. Cost is also subjective if you are considering multiple vehicles like Subaru vs 3-Series or C-series or whatever. (I'm sure that last statement will ruffle feathers, but everyone has a different vehicles they will consider.)\n\nUltimately, drive 'em and see what you like."}, {"user_id": "vchiu", "date": "January 23, 2006 8:33PM", "comment": ">Ideally BMW will release a 335i soon and I can get the power bump I long for.\n\nI am not sure they will because one of their most renown sports tuner -Alpina- already offers a 3,4 liter 300 HP version. the E90 version should be out soon\n\nhttp://212.227.48.10/index.php\n\n\"The heart of the new BMW ALPINA B3 S is its in-line six-cylinder engine with 3.4 litre displacement. Peak performance of 305bhp (224kW) is garnered at 6300rpm, with maximum torque of 362Nm achieved at 4800rpm. 90% of available torque is at your command from 2500rpm to 6500rpm, making driving a daily occurrence\"\n\nDon't know why Alpina is so little known in the US."}, {"user_id": "nyccarguy", "date": "January 23, 2006 9:51PM", "comment": "I agree with blueguydotcom. The IS350 is one fast ride. The suspension was too soft, the car pitched and rolled, the brake pedal was soft... Speed is last on my performance list. In NY the highways are crawling with cops and when they're not, traffic is terrible. It would be nice, but isn't necessary.\n\nI got back into my '01 Prelude Type SH after driving the IS350 and despite it's serious horsepower & torque deficiencies is a much more fun to drive car."}, {"user_id": "blueguydotcom", "date": "January 23, 2006 11:29PM", "comment": "Don't have any interest in aftermarket tuners. The 3.5 and or 3.0TT BMW is supposed to produce soon should do the trick."}, {"user_id": "vchiu", "date": "January 24, 2006 7:39PM", "comment": ">Don't have any interest in aftermarket tuners\n\nDo you consider AMG or the Motorsport division of BMW as such? If yes, then naturally, Alpina who works basically the same way with BMW can't be of any interest to you.\n\nMaybe should BMW shoehorn a 4L V8 to make for a 340. But it would be too close to the M3\n\nI heard that the 6-in line has limitations that make pushing to 3,5L displacement difficult."}, {"user_id": "blueguydotcom", "date": "January 24, 2006 7:42PM", "comment": "AMG i have no use for...it's MB afterall. As for M, it's an actual division of BMW. Alpina is not. Alpina is like Dinan, just a tuner I want nothing to do with."}, {"user_id": "vchiu", "date": "January 24, 2006 10:10PM", "comment": ">Alpina is like Dinan, just a tuner I want nothing to do with.\n\nHow can you compare Alpina to Dinan???\n\nDo you know many BMW-based brands that can be bought and serviced in the BMW network (in Europe)?\nDinan just makes some aftermaket tuning pieces whereas Alpina has its cars built on BMW lines and fit with their powertrains in their own factory. Engine is individually signed by the Engineer in charge. Alpina don't sell upgrade chip and can not sell performance upgrade for second hand BMW.\n\nThe B5 they are making is considered as the most serious rival to the M5, with the benefit of extra exclusivity\n\nhttp://212.227.48.10/downloads/testberichte/en1118397377autocar_05_2005.pdf\n\nit is true they don't have a strong offer for the E90, except a diesel that makes 23 mpg at 125 mph..\n\nYou don't want Alpina, this is your choice, but pls don't compare Alpina to an aftermarket tuner even if the latter is expensive\n\n\n\nAnyway, it is your choice, but Alpina can't be compared to Hartge or Schnitzer or even Brabus."}]